<a href="https://colab.research.google.com/github/cinngyang/Python/blob/master/Pandas_%E8%B3%87%E6%96%99%E5%89%8D%E7%BD%AE%E8%99%95%E7%90%86.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#處理遺失資料
+ dropna , fillna , isull , notnull
+ DataFrame 預設只要一筆就刪除
+ frame.dropna(axis=1,how='all')
+ 填值 frame.fillna(0) , 可填 dic frame.fillna({column:vals ,column:vals })
+ 先計算均值再填入 na 
+ 重複 duplicated()
+ function 對應轉換值 DataFrame['columns'].map(dict)
+ replace
+ 更名軸 frame.index.map()
+ 分組 cut

In [0]:
from numpy import nan as NA
import numpy as np
import pandas as pd

In [0]:
data=pd.Series([1,NA,3.5,NA,7])
print(data)
print(data.dropna())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64
0    1.0
2    3.5
4    7.0
dtype: float64

In [0]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [0]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [0]:
lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [0]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [0]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# 分組
+ pandas.cut(series,bin,label=list)
+ pd.cut(data,4,percision=2) , 分 4 組 , 小數 2 位
+ codes 
+ categories
+ pd.value_counts()
+ qcut 依樣本分組

In [0]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [0]:
print('cats.codes',cats.codes)
print('cats.categories',cats.categories)
pd.value_counts(cats)

cats.codes [0 0 0 1 0 0 2 1 3 2 2 1]
cats.categories IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

# 字串操作
+ strip()
+ split()
+ 字串分解結合
+ join
+ find , index , in , index 找不到回 except , find 回傳 -1
+ count , replace

In [0]:
val='a,b,  guido'
val

'a,b,  guido'

In [0]:
piecs=[x.strip() for x in val.split(',')]
piecs

['a', 'b', 'guido']

In [0]:
first , second,third=piecs
print('first',first)
print('second',second)
print('third',third)
first+"::"+ third+"::"+second
"::".join(piecs)

first a
second b
third guido

'a::b::guido'

# 正規表示試(樣式比對 / 替代 / 切分)

In [0]:
import re
text="food   bar\t  baz  \tqux"

# 資料連接合併與重組
+ Multi-Index 階層式索引 - 部份索引操作子資料集 series[:,indx2]
+ unstack() & stack()
+ DataFrame 每個軸都可以有自己的階層式索引, 每層索引可指定自己的名字
+ sort_index / swaplevel
+ pd.merge(df1,df2,how='outer') ., inner , left, right 
+ pd.merge(dt1,df2 , left_on='key' , right_on='key')
+ pd.concat

In [0]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),
                  index=[['a','a','b','b'],[1,2,1,2]],
                  columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [0]:
frame.index.names=['key1','key2']
frame.columns.names=['State','color']
frame

State      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [0]:
frame.sum(level='key2')

State  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [0]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [0]:
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names=['State','color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['State', 'color'])

In [0]:
data=pd.Series(np.random.randn(9),
              index=[['a','a','a','b','b','c','c','d','d'],
                     [1,2,3,1,3,1,2,2,3]])
data

a  1    0.660637
   2    0.011188
   3   -0.122192
b  1   -0.513135
   3   -1.113466
c  1    0.957307
   2    1.446600
d  2    0.248292
   3    1.193939
dtype: float64

In [0]:
data['b']
print(data['b':'c'])
print(data[:,2])

b  1   -0.513135
   3   -1.113466
c  1    0.957307
   2    1.446600
dtype: float64
a    0.011188
c    1.446600
d    0.248292
dtype: float64